// # Масиви та методи рядкочків

// 1. Напиши цикл, який виведе на консоль числа від 1 до 10.
// for (let i = 1; i <= 10; i++) {
//   console.log(i);
// }

// 1. Напиши цикл, який виведе на консоль парні числа від 1 до 20.
// for (let i = 1; i <= 20; i++) {
//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

// 1. Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 0 до 100.
// let sum = 0;
// for (let i = 0; i <= 100; i++) {
//   sum += i;
// }
// console.log(sum);

// Напиши цикл, який знайде суму всіх парних чисел від 0 до 100.
// let sum = 0;
// for (let i = 0; i <= 100; i++) {
//   if (i % 2 === 0) {
//     sum += i;
//   }
// }

// Напиши цикл, який знайде суму всіх непарних чисел від 1 до 99.

// let sum = 0;
// for (let i = 1; i <= 99; i++){
//     if (i%2!==0){sum += i}:
// }
// Напиши цикл, який знайде та виведе суму чисел від 100 до 200.

// let sum = 0;
// for (let i = 100; i <= 200; i++) {
//   sum += i;
// }
// Напиши цикл, який знайде суму чисел від 1 до n (де n задається змінною).

// let sum = 0;
// for (let i = 1; i <= n; i++) {
//   sum += i;
// }

// Напиши цикл, який знайде суму всіх чисел від 0 до 100, що діляться на 5.
// Напиши цикл, який знайде суму квадратів чисел від 1 до 10.

// let sum = 0;
// for (let i = 1; i <= n; i++) {
//   sum += i;
// }

// Напиши цикл, який знайде суму чисел у зворотному порядку: від 50 до 1.

// let sum = 0;
// for (let i = 1; i <= 50; i++) {
//   sum += i;
// }

// 1. Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до
//    10).
// for (let i = 1; i <= 10; i++) {
//   console.log(`7 x ${i} = ${7 * i}`);
// }
// 1. Напиши цикл, який обчислить факторіал числа, введеного користувачем
//    (наприклад, факторіал числа 5: `!5 = 1 * 2 * 3 * 4 * 5`).

// const n = Number(prompt('Введи число для факторіала:'));
// let factorial = 1;

// for (let i = 1; i <= n; i++) {
//   factorial *= i;
// }

// console.log(`!${n} = ${factorial}`);

// 1. Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"

// const text = 'Hello world';
// for (let i = 1; i < text.length; i += 2) {
//   console.log(text[i]);
// }
// 1. Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому
//    порядку.

// const reversedText = 'Hello world';
// for (let i = reversedText.length - 1; i >= 0; i--) {
//   console.log(reversedText[i]);
// }

// 1. Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне
//    пробіл.
// const textUntilSpace = 'Hello world';
// for (let i = 0; i < textUntilSpace.length; i++) {
//   if (textUntilSpace[i] === ' ') {
//     break;
//   }
//   console.log(textUntilSpace[i]);
// }
// 1. Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".
// const javaScriptText = 'JavaScript';
// for (let i = 1; i < javaScriptText.length; i += 2) {
//   console.log(javaScriptText[i]);
// }
// 1. Напиши функцію, яка приймає рядок та повертає перевернутий рядок
// 1. Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у
//    верхньому регістрі
// 1. Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до
//    рядочка str1 стільки разів скільки вказали у параметрі count.
